app/controllers/friends_controller.rb

  def create
    #@friend = Friend.new(friend_params)
    @friend = current_user.friends.build(friend_params)

    respond_to do |format|
      if @friend.save
---
INSERT INTO "friends" ("first_name", "last_name", "email", "phone", "twitter", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    respond_to do |format|
      if @friend.update(friend_params)
---
UPDATE "friends" SET "last_name" = ?, "email" = ?, "phone" = ?, "twitter" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["last_name", "manu2doi"], ["email", "manu@doi2"], ["phone", "123233313"], ["twitter", "@doimanu"], ["updated_at", "2023-12-18 19:49:32.856654"], ["id", 27]]